liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
        MC_CalculateSpaceVectorPhaseShifted_Assembly(&vabc,pwmPeriod,
                                                    &pwmDutycycle);
        PWMDutyCycleSet(&pwmDutycycle);            
    }
  
    else
    {
        INVERTERA_PWM_TRIGA = ADC_SAMPLING_POINT;
        pwmDutycycle.dutycycle3 = MIN_DUTY;
        pwmDutycycle.dutycycle2 = MIN_DUTY;
        pwmDutycycle.dutycycle1 = MIN_DUTY;
        PWMDutyCycleSet(&pwmDutycycle);
    } 
    if (uGF.bits.MotorState == 0)
    {
        measureInputs.current.Ia = ADCBUF_INV_A_IPHASE1;
        measureInputs.current.Ib = ADCBUF_INV_A_IPHASE2; 
        measureInputs.current.Ibus = ADCBUF_INV_A_IBUS; 
    }
   
    //If the offset value wasn't recently updated we measure it.
    if (MCAPP_MeasureCurrentOffsetStatus(&measureInputs) == 0)
    {
       //
        MCAPP_MeasureCurrentOffset(&measureInputs);
    }
    else
    {
        //Increments number of times it's entered ISR, don't know why we only do this sometimes
        BoardServiceStepIsr(); 
    }
    
    //Need to change the potvalue, this will instead be controlled by spi inputs
    measureInputs.potValue = (int16_t)( ADCBUF_SPEED_REF_A>>1);
    
    
    measureInputs.dcBusVoltage = (int16_t)( ADCBUF_VBUS_A>>1);

    //Measuring temp is good for errors
    MCAPP_MeasureTemperature(&measureInputs,(int16_t)(ADCBUF_MOSFET_TEMP_A>>1));

    //Update X2C scope
    DiagnosticsStepIsr();
    /* Read ADC Buffet to Clear Flag */
	adcDataBuffer = ClearADCIF_ReadADCBUF();
    ClearADCIF();   
}

void __attribute__((interrupt, no_auto_psv)) _SPI1Interrupt(void)
{
    // Check if SPI receive buffer is full
    if (SPI1STATLbits.SPIRBF) {
        rxBuffer[rxIndex++] = SPI1BUFL;  // Read received data

        // Check if we have received 1 byte
        if (rxIndex == 1) {
            // Prepare to send 17 bytes back
            txIndex = 0;
            txBytesToSend = 17;
            SPI1BUFL = txBuffer[txIndex++]; // Start sending first byte
        }

        // Clear SPI receive interrupt flag
        IFS0bits.SPI1RXIF = 0;
    }

    // Check if SPI transmit buffer is empty
    if (SPI1STATLbits.SPITBF == 0 && txBytesToSend > 0) {
        SPI1BUFL = txBuffer[txIndex++]; // Send next byte

        if (--txBytesToSend == 0) {
            // All bytes have been sent
            txIndex = 0;
        }

        // Clear SPI transmit interrupt flag
        IFS0bits.SPI1TXIF = 0;
    }
}


// *****************************************************************************
/* Function:
    CalculateParkAngle ()

  Summary:
    Function calculates the angle for open loop control

  Description:
    Generate the start sine waves feeding the motor terminals
    Open loop control, forcing the motor to align and to start speeding up .
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void CalculateParkAngle(void)
{
    /* if open loop */
    if (uGF.bits.OpenLoop)
    {
        /* begin with the lock sequence, for field alignment */
        if (motorStartUpData.startupLock < LOCK_TIME)
        {
            motorStartUpData.startupLock += 1;
        }
        /* Then ramp up till the end speed */
        else if (motorStartUpData.startupRamp < END_SPEED)
        {
            motorStartUpData.startupRamp += OPENLOOP_RAMPSPEED_INCREASERATE;
        }
        /* Switch to closed loop */
        else 
        {
                #ifndef OPEN_LOOP_FUNCTIONING
                    uGF.bits.ChangeMode = 1;
                    uGF.bits.OpenLoop = 0;
                #endif
            }
        /* The angle set depends on startup ramp */
        thetaElectricalOpenLoop = sectorToAngle[mcappData.sector];
        mcappData.HallTheta = thetaElectricalOpenLoop;
    }
}
// *****************************************************************************
/* Function:
    InitControlParameters()

  Summary:
    Function initializes control parameters

  Description:
    Initialize control parameters: PI coefficients, scaling constants etc.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitControlParameters(void)
{
    
    ctrlParm.qRefRamp = SPEEDREFRAMP;
    ctrlParm.speedRampCount = SPEEDREFRAMP_COUNT;
    /* Set PWM period to Loop Time */
    pwmPeriod = LOOPTIME_TCY;
 
    /* PI - Id Current Control */
    piInputId.piState.kp = D_CURRCNTR_PTERM;
    piInputId.piState.ki = D_CURRCNTR_ITERM;
    piInputId.piState.kc = D_CURRCNTR_CTERM;
    piInputId.piState.outMax = D_CURRCNTR_OUTMAX;
    piInputId.piState.outMin = -piInputId.piState.outMax;
    piInputId.piState.integrator = 0;
    piOutputId.out = 0;

    /* PI - Iq Current Control */
    piInputIq.piState.kp = Q_CURRCNTR_PTERM;
    piInputIq.piState.ki = Q_CURRCNTR_ITERM;
    piInputIq.piState.kc = Q_CURRCNTR_CTERM;
    piInputIq.piState.outMax = Q_CURRCNTR_OUTMAX;
    piInputIq.piState.outMin = -piInputIq.piState.outMax;
    piInputIq.piState.integrator = 0;
    piOutputIq.out = 0;

    /* PI - Speed Control */
    piInputOmega.piState.kp = SPEEDCNTR_PTERM;
    piInputOmega.piState.ki = SPEEDCNTR_ITERM;
    piInputOmega.piState.kc = SPEEDCNTR_CTERM;
    piInputOmega.piState.outMax = SPEEDCNTR_OUTMAX;
    piInputOmega.piState.outMin = -piInputOmega.piState.outMax;
    piInputOmega.piState.integrator = 0;
    piOutputOmega.out = 0;
}

void __attribute__((__interrupt__,no_auto_psv)) _PWMInterrupt()
{
    ResetParmeters();
    ClearPWMPCIFaultInverterA();
    LED1 = 1; 
    ClearPWMIF(); 
}
